### Plan for production
🟢 Add module.edit_feature_flag_queue_subscription.aws_sns_topic_subscription.topic_queue_subscription["arn:aws:sns:eu-west-1:090999133015:feature_flag_edited"]
🟢 Add module.edit_feature_flag_queue_subscription.aws_sqs_queue_policy.queue_policy
🟢 Add module.edited_feature_flag_queue.datadog_monitor.dead_letter_queue_messages_monitor[0]
🟢 Add module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestChangeEvent"]
🟢 Add module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestParticipantAllocationEvent"]
🟢 Add module.edited_feature_flag_queue.module.dead_letter_queue[0].aws_sqs_queue.this[0]
🟢 Add module.edited_feature_flag_queue.module.encrypted_queue.aws_sqs_queue.this[0]
🟢 Add module.edited_feature_flag_queue.module.encrypted_queue.aws_sqs_queue_redrive_policy.this[0]
🟡 Modify aws_iam_policy.ab_testing_task_role_policy
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"]
🟠 Replace module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"]
🟠 Replace module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition

**8 to add, 1 to modify, 3 to replace, 0 to delete**

<details><summary>Show detailed plan</summary>

```terraform
Terraform will perform the following actions:

  # data.aws_iam_policy_document.ab_testing_permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ab_testing_permissions" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:eu-west-1:090999133015:table/ab_test_participants",
              + "arn:aws:dynamodb:eu-west-1:090999133015:table/ab_tests",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "vpc-08c2ab7b7b894be17",
                ]
              + variable = "aws:sourceVpc"
            }
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:GetQueueUrl",
              + "sqs:ReceiveMessage",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_iam_policy.ab_testing_task_role_policy will be updated in-place
  ~ resource "aws_iam_policy" "ab_testing_task_role_policy" {
        id          = "arn:aws:iam::090999133015:policy/ab-testing-task-role-policy"
        name        = "ab-testing-task-role-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "aws:sourceVpc" = "vpc-08c2ab7b7b894be17"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = [
                          - "arn:aws:dynamodb:eu-west-1:090999133015:table/ab_tests",
                          - "arn:aws:dynamodb:eu-west-1:090999133015:table/ab_test_participants",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # module.edit_feature_flag_queue_subscription.data.aws_iam_policy_document.queue_policy_data will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "queue_policy_data" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:GetQueueUrl",
              + "sqs:SendMessage",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnEquals"
              + values   = [
                  + "arn:aws:sns:eu-west-1:090999133015:feature_flag_edited",
                ]
              + variable = "aws:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.edit_feature_flag_queue_subscription.aws_sns_topic_subscription.topic_queue_subscription["arn:aws:sns:eu-west-1:090999133015:feature_flag_edited"] will be created
  + resource "aws_sns_topic_subscription" "topic_queue_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "sqs"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:eu-west-1:090999133015:feature_flag_edited"
    }

  # module.edit_feature_flag_queue_subscription.aws_sqs_queue_policy.queue_policy will be created
  + resource "aws_sqs_queue_policy" "queue_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # module.edited_feature_flag_queue.datadog_monitor.dead_letter_queue_messages_monitor[0] will be created
  + resource "datadog_monitor" "dead_letter_queue_messages_monitor" {
      + enable_samples      = (known after apply)
      + evaluation_delay    = (known after apply)
      + id                  = (known after apply)
      + include_tags        = true
      + message             = <<-EOT
            There are currently {{value}} failed messages on edited_feature_flag_dead_letter_queue in production
                
                Notify:
                    @slack-multi-product-alerts
        EOT
      + name                = "edited_feature_flag_dead_letter_queue production monitor (Terraform)"
      + new_host_delay      = 300
      + notify_no_data      = false
      + query               = "avg(last_5m):avg:aws.sqs.approximate_number_of_messages_visible{queuename:edited_feature_flag_dead_letter_queue,env:production} >= 1"
      + renotify_interval   = 360
      + renotify_statuses   = [
          + "alert",
          + "no data",
        ]
      + require_full_window = true
      + tags                = [
          + "env:production",
          + "team:multi-product",
          + "terraform",
        ]
      + type                = "metric alert"

      + monitor_thresholds {
          + critical = "1"
        }
    }

  # module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestChangeEvent"] will be created
  + resource "aws_glue_schema" "event_glue_schema" {
      + arn                   = (known after apply)
      + compatibility         = "BACKWARD"
      + data_format           = "JSON"
      + id                    = (known after apply)
      + latest_schema_version = (known after apply)
      + next_schema_version   = (known after apply)
      + registry_arn          = "arn:aws:glue:eu-west-1:090999133015:registry/automotive"
      + registry_name         = (known after apply)
      + schema_checkpoint     = (known after apply)
      + schema_definition     = jsonencode(
            {
              + "$schema"  = "http://json-schema.org/draft-07/schema#"
              + properties = {
                  + eventData       = {
                      + allOf = [
                          + {
                              + description = "Changing Ab Test Event data."
                              + properties  = {
                                  + abChangeType              = {
                                      + description = "The type of change that has occurred"
                                      + enum        = [
                                          + "STARTED",
                                          + "RESTARTED",
                                          + "DISTRIBUTION_CHANGE",
                                          + "STOPPED",
                                          + "REALLOCATED",
                                        ]
                                      + type        = "string"
                                    }
                                  + latestReallocationVersion = {
                                      + description = "Does the version ."
                                      + type        = "integer"
                                    }
                                  + testGroups                = {
                                      + description = "Current Groups and Weightings for the test"
                                      + items       = {
                                          + properties = {
                                              + name      = {
                                                  + type = "string"
                                                }
                                              + weighting = {
                                                  + type = "string"
                                                }
                                            }
                                          + type       = "object"
                                        }
                                      + type        = "array"
                                    }
                                }
                              + type        = "object"
                            },
                          + {
                              + description = "The event payload."
                            },
                        ]
                    }
                  + eventTime       = {
                      + description = "When the event occurred."
                      + type        = "string"
                    }
                  + metadata        = {
                      + description = "Metadata used by producer library to identify the event."
                      + properties  = {
                          + event_id    = {
                              + description = "unique id for the event."
                              + type        = "string"
                            }
                          + event_type  = {
                              + description = "the type of event."
                              + type        = "string"
                            }
                          + occurred_at = {
                              + description = "The time the event occurred at/was first produced."
                              + type        = "string"
                            }
                          + service     = {
                              + description = "the service provider"
                              + type        = "string"
                            }
                        }
                      + type        = "object"
                    }
                  + participantId   = {
                      + description = "The ID of the quote."
                      + type        = "string"
                    }
                  + resourceVersion = {
                      + description = "The version of the quote after the event has been applied."
                      + type        = "integer"
                    }
                }
              + type       = "object"
            }
        )
      + schema_name           = "AbTestChangeEvent"
      + tags_all              = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
    }

  # module.event_sourcing.aws_glue_schema.event_glue_schema["AbTestParticipantAllocationEvent"] will be created
  + resource "aws_glue_schema" "event_glue_schema" {
      + arn                   = (known after apply)
      + compatibility         = "BACKWARD"
      + data_format           = "JSON"
      + id                    = (known after apply)
      + latest_schema_version = (known after apply)
      + next_schema_version   = (known after apply)
      + registry_arn          = "arn:aws:glue:eu-west-1:090999133015:registry/automotive"
      + registry_name         = (known after apply)
      + schema_checkpoint     = (known after apply)
      + schema_definition     = jsonencode(
            {
              + "$schema"  = "http://json-schema.org/draft-07/schema#"
              + properties = {
                  + eventData       = {
                      + allOf = [
                          + {
                              + description = "Saving Ab Test Participant Event data."
                              + properties  = {
                                  + testGrouping = {
                                      + type = "string"
                                    }
                                  + testId       = {
                                      + description = "List of deeplinked addons for the quote."
                                      + type        = "string"
                                    }
                                  + testVersion  = {
                                      + type = "integer"
                                    }
                                }
                              + type        = "object"
                            },
                          + {
                              + description = "The event payload."
                            },
                        ]
                    }
                  + eventTime       = {
                      + description = "When the event occurred."
                      + type        = "string"
                    }
                  + metadata        = {
                      + description = "Metadata used by producer library to identify the event."
                      + properties  = {
                          + event_id    = {
                              + description = "unique id for the event."
                              + type        = "string"
                            }
                          + event_type  = {
                              + description = "the type of event."
                              + type        = "string"
                            }
                          + occurred_at = {
                              + description = "The time the event occurred at/was first produced."
                              + type        = "string"
                            }
                          + service     = {
                              + description = "the service provider"
                              + type        = "string"
                            }
                        }
                      + type        = "object"
                    }
                  + participantId   = {
                      + description = "The ID of the quote."
                      + type        = "string"
                    }
                  + resourceVersion = {
                      + description = "The version of the quote after the event has been applied."
                      + type        = "integer"
                    }
                }
              + type       = "object"
            }
        )
      + schema_name           = "AbTestParticipantAllocationEvent"
      + tags_all              = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestChangeEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "921069819333476033" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T18:24:52Z" -> (known after apply)
        }
    }

  # module.event_sourcing.null_resource.update_checkpoint["AbTestParticipantAllocationEvent"] must be replaced
-/+ resource "null_resource" "update_checkpoint" {
      ~ id       = "7965920405644496115" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2023-11-08T18:24:52Z" -> (known after apply)
        }
    }

  # module.ab_testing.module.java_ecs_service.aws_ecs_task_definition.service_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "service_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:090999133015:task-definition/ab-testing:15" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:090999133015:task-definition/ab-testing" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 482
                  - dependsOn        = [
                      - {
                          - condition     = "HEALTHY"
                          - containerName = "envoy"
                        },
                    ]
                  - dockerLabels     = {
                      - "com.datadoghq.ad.check.id"  = "openmetrics"
                      - "com.datadoghq.tags.env"     = "production"
                      - "com.datadoghq.tags.service" = "uk-multi-ab-testing"
                      - "com.marshmallow.alert-team" = "multi-product"
                    }
                  - environment      = [
                      - {
                          - name  = "DD_ENV"
                          - value = "production"
                        },
                      - {
                          - name  = "DD_REMOTE_CONFIGURATION_ENABLED"
                          - value = "false"
                        },
                      - {
                          - name  = "DD_SERVICE"
                          - value = "uk-multi-ab-testing"
                        },
                      - {
                          - name  = "DD_TRACE_SAMPLE_RATE"
                          - value = "0.5"
                        },
                      - {
                          - name  = "DD_VERSION"
                          - value = "0.0.16-79"
                        },
                      - {
                          - name  = "cloud.aws.credentials.instanceProfile"
                          - value = "true"
                        },
                      - {
                          - name  = "cloud.aws.region.use-default-aws-region-chain"
                          - value = "true"
                        },
                      - {
                          - name  = "logging.level.com.marshmallow.uk_multi_ab_testing"
                          - value = "DEBUG"
                        },
                      - {
                          - name  = "management.endpoints.web.exposure.include"
                          - value = "health,prometheus"
                        },
                      - {
                          - name  = "management.server.port"
                          - value = "8080"
                        },
                      - {
                          - name  = "spring.profiles.active"
                          - value = "production"
                        },
                    ]
                  - essential        = true
                  - healthCheck      = {
                      - command     = [
                          - "CMD-SHELL",
                          - "wget -qO- localhost:8080/actuator/health | jq --exit-status -n 'inputs | if has(\"status\") then .status==\"UP\" else false end'",
                        ]
                      - interval    = 5
                      - retries     = 3
                      - startPeriod = 300
                      - timeout     = 5
                    }
                  - image            = "007126583757.dkr.ecr.eu-west-1.amazonaws.com/uk-multi-ab-testing:0.0.16-79"
                  - logConfiguration = {
                      - logDriver     = "awsfirelens"
                      - options       = {
                          - Host       = "http-intake.logs.datadoghq.eu"
                          - Name       = "datadog"
                          - dd_service = "uk-multi-ab-testing"
                          - dd_source  = "java"
                          - dd_tags    = "env:production,product:multi,product_region:uk,team:multi-product"
                          - provider   = "ecs"
                          - tls        = "on"
                        }
                      - secretOptions = [
                          - {
                              - name      = "apikey"
                              - valueFrom = "arn:aws:secretsmanager:eu-west-1:090999133015:secret:datadog/api-key-BYlukP"
                            },
                        ]
                    }
                  - mountPoints      = []
                  - name             = "ab-testing"
                  - portMappings     = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = []
                  - volumesFrom      = []
                },
              - {
                  - cpu          = 10
                  - environment  = [
                      - {
                          - name  = "DD_APM_ENABLED"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_DOCKER_LABELS_AS_TAGS"
                          - value = jsonencode(
                                {
                                  - "com.marshmallow.alert-team" = "team"
                                }
                            )
                        },
                      - {
                          - name  = "DD_ENV"
                          - value = "production"
                        },
                      - {
                          - name  = "DD_LOGS_INJECTION"
                          - value = "true"
                        },
                      - {
                          - name  = "DD_REMOTE_CONFIGURATION_ENABLED"
                          - value = "false"
                        },
                      - {
                          - name  = "DD_SITE"
                          - value = "datadoghq.eu"
                        },
                      - {
                          - name  = "ECS_FARGATE"
                          - value = "true"
                        },
                      - {
                          - name  = "JAVA_ACTUATOR_PORT"
                          - value = "8080"
                        },
                    ]
                  - essential    = false
                  - image        = "007126583757.dkr.ecr.eu-west-1.amazonaws.com/marshmallow-datadog-agent:latest"
                  - mountPoints  = []
                  - name         = "datadog-agent"
                  - portMappings = [
                      - {
                          - containerPort = 8126
                          - hostPort      = 8126
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets      = [
                      - {
                          - name      = "DD_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:eu-west-1:090999133015:secret:datadog/api-key-BYlukP"
                        },
                    ]
                  - volumesFrom  = []
                },
              - {
                  - cpu                   = 10
                  - environment           = []
                  - essential             = true
                  - firelensConfiguration = {
                      - options = {
                          - config-file-type        = "file"
                          - config-file-value       = "/fluent-bit/configs/marshmallow-config.conf"
                          - enable-ecs-log-metadata = "true"
                        }
                      - type    = "fluentbit"
                    }
                  - image                 = "007126583757.dkr.ecr.eu-west-1.amazonaws.com/marshmallow-fluent-bit:latest"
                  - logConfiguration      = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "ab-testing-aws-for-fluent-bit-sidecar-logs"
                          - awslogs-region        = "eu-west-1"
                          - awslogs-stream-prefix = "ab-testing-aws-for-fluent-bit-sidecar-logs"
                        }
                    }
                  - mountPoints           = []
                  - name                  = "aws-for-fluent-bit"
                  - portMappings          = []
                  - user                  = "0"
                  - volumesFrom           = []
                },
              - {
                  - cpu              = 10
                  - dockerLabels     = {
                      - "com.datadoghq.ad.check_names"  = jsonencode(
                            [
                              - "envoy",
                            ]
                        )
                      - "com.datadoghq.ad.init_configs" = jsonencode(
                            [
                              - {},
                            ]
                        )
                      - "com.datadoghq.ad.instances"    = jsonencode(
                            [
                              - {
                                  - stats_url = "http://%%host%%:9901/stats"
                                },
                            ]
                        )
                      - "com.datadoghq.tags.env"        = "production"
                      - "com.marshmallow.alert-team"    = "multi-product"
                    }
                  - environment      = [
                      - {
                          - name  = "APPMESH_RESOURCE_ARN"
                          - value = "arn:aws:appmesh:eu-west-1:090999133015:mesh/marshmallow@230488382832/virtualNode/ab-testing"
                        },
                      - {
                          - name  = "DD_ENV"
                          - value = "production"
                        },
                      - {
                          - name  = "DD_SERVICE"
                          - value = "envoy/uk-multi-ab-testing"
                        },
                      - {
                          - name  = "ENVOY_LOG_LEVEL"
                          - value = "info"
                        },
                    ]
                  - essential        = true
                  - healthCheck      = {
                      - command     = [
                          - "CMD-SHELL",
                          - "curl -s http://localhost:9901/server_info | grep state | grep -q LIVE",
                        ]
                      - interval    = 10
                      - retries     = 10
                      - startPeriod = 300
                      - timeout     = 5
                    }
                  - image            = "840364872350.dkr.ecr.eu-west-1.amazonaws.com/aws-appmesh-envoy:v1.20.0.1-prod"
                  - logConfiguration = {
                      - logDriver     = "awsfirelens"
                      - options       = {
                          - Host       = "http-intake.logs.datadoghq.eu"
                          - Name       = "datadog"
                          - dd_service = "uk-multi-ab-testing"
                          - dd_source  = "envoy"
                          - dd_tags    = "env:production,product:multi,product_region:uk"
                          - provider   = "ecs"
                          - tls        = "on"
                        }
                      - secretOptions = [
                          - {
                              - name      = "apikey"
                              - valueFrom = "arn:aws:secretsmanager:eu-west-1:090999133015:secret:datadog/api-key-BYlukP"
                            },
                        ]
                    }
                  - memory           = 256
                  - mountPoints      = []
                  - name             = "envoy"
                  - portMappings     = []
                  - user             = "1337"
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "ab-testing" -> (known after apply)
      ~ revision                 = 15 -> (known after apply)
      ~ tags                     = {
            "service" = "ab-testing"
          ~ "version" = "0.0.16-79" -> "0.0.18-88"
        }
      ~ tags_all                 = {
          ~ "version"        = "0.0.16-79" -> "0.0.18-88"
            # (6 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.edited_feature_flag_queue.module.dead_letter_queue[0].aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + kms_master_key_id                 = "a4b78f77-eade-43ce-9b21-6070fa66179d"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "edited_feature_flag_dead_letter_queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "service" = "ab-testing"
        }
      + tags_all                          = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service"        = "ab-testing"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.edited_feature_flag_queue.module.encrypted_queue.aws_sqs_queue.this[0] will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 180
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = 86400
      + kms_master_key_id                 = "a4b78f77-eade-43ce-9b21-6070fa66179d"
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "edited_feature_flag"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "service" = "ab-testing"
        }
      + tags_all                          = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service"        = "ab-testing"
          + "service_name"   = "ab-testing"
          + "team"           = "multi-product"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 120
    }

  # module.edited_feature_flag_queue.module.encrypted_queue.aws_sqs_queue_redrive_policy.this[0] will be created
  + resource "aws_sqs_queue_redrive_policy" "this" {
      + id             = (known after apply)
      + queue_url      = (known after apply)
      + redrive_policy = (known after apply)
    }

Plan: 11 to add, 1 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.event_sourcing.module.table.snowflake_table.this,
  on .terraform/modules/event_sourcing.table/snowflake/modules/table/main.tf line 21, in resource "snowflake_table" "this":
  21:   data_retention_days = 7

Use data_retention_time_in_days attribute instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: production.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "production.plan"

```
</details>